In [1]:
import numpy as np
import pandas as pd

In [40]:
##Series Data Structure - A labelled Array of dict,ndarray,list,constant

#Series with dict as data
index = ['x','y','z','a']
data = {'x' : 1 , 'y':2 , 'z':3}
s = pd.Series(data,index)

In [43]:
print(s)
print(s['x']) #Access it like a dictionary

x    1.0
y    2.0
z    3.0
a    NaN
dtype: float64
1.0

In [37]:
#Series with scalar as data
s1 = pd.Series(5,index =[i for i in range(10)])

In [38]:
s1
print(s1[1]) #Access like list or ndarray

5

In [30]:
#Series with ndarray as data
data = [1,3,4,55,654,9,10]
s2 = pd.Series(np.random.permutation(data))

<type 'numpy.ndarray'>

In [39]:
s2

55

In [32]:
#
data =[8,9,71,10,11,14]
s3 = pd.Series(data)

In [46]:
print(s3)
#indexing
print(s3[1:4])
s3[[3,4,5]]

0     8
1     9
2    71
3    10
4    11
5    14
dtype: int64
1     9
2    71
3    10
dtype: int64

3    10
4    11
5    14
dtype: int64

In [51]:
#Dataframe is a 2-D data structure can be considered as dict of Series objects


#dict of series object
data = {
         'column1' : pd.Series([1,2,3,4],index=['a','b','c','d']),
         'column2' : pd.Series([4,5],index=['c','d']),
         'column3' : pd.Series([4,5,3],index=['a','b','c'])
} 

df = pd.DataFrame(data=data)

In [52]:
df

   column1  column2  column3
a        1      NaN      4.0
b        2      NaN      5.0
c        3      4.0      3.0
d        4      5.0      NaN

In [55]:
#dict of lists
data = {
         'column1' : [1,23,4,5],
         'column2' : [3,24,25,20]
}

df1 = pd.DataFrame(data=data)
df1

   column1  column2
0        1        3
1       23       24
2        4       25
3        5       20

In [95]:
data = np.zeros((3,), dtype=[('A', 'i4'),('B', 'f4'),('C', 'a10')])#int,float,string
data[:] = [(1,2,'hello'),(2,3,'world'),(4,5,'new')]
#new_data = np.concatenate((data,data2))
data

array([(1, 2., 'hello'), (2, 3., 'world'), (4, 5., 'new')],
      dtype=[('A', '<i4'), ('B', '<f4'), ('C', 'S10')])

In [96]:
df2 = pd.DataFrame(data)
df2

   A    B      C
0  1  2.0  hello
1  2  3.0  world
2  4  5.0    new

In [101]:
dataList = data.tolist()
dataList.append((1,12,'yo'))
df2 = pd.DataFrame(dataList,columns=df2.columns)

In [102]:
df2

   A     B      C
0  1   2.0  hello
1  2   3.0  world
2  4   5.0    new
3  1  12.0     yo

In [112]:
df3 = pd.DataFrame()
data1 = dict([('A',[1,2,3]),('B',[4,5,6]),('C',[1,5,6])])
df3 = df3.from_dict(data1,orient='columns')
df3

   A  B  C
0  1  4  1
1  2  5  5
2  3  6  6

In [115]:
#dataframe operations in pandas
df3['D'] = df3['A']*df3['B']
df3['trunc_A'] = df3['A'][:1]
df3.insert(2,'inserted_at_2',df3['A']) #insert column at position 2
df3

ValueError: cannot insert inserted_at_2, already exists

In [121]:
df3

   A  B  inserted_at_2  C   D  trunc_A
0  1  4              1  1   4      1.0
1  2  5              2  5  10      NaN
2  3  6              3  6  18      NaN

In [124]:
df4 = df3.query('B > 0').assign(prod=df3['A']*df3['B'])
df4

   A  B  inserted_at_2  C   D  trunc_A  prod
0  1  4              1  1   4      1.0     4
1  2  5              2  5  10      NaN    10
2  3  6              3  6  18      NaN    18

In [126]:
df4.plot(kind='line', x='A', y='B')

In [135]:
#iloc and loc

#iloc is to locate a row by integer index
#loc is by label or index name
row_label_0 = df4.iloc[0]
list(row_label_0)

#Slicing rows of a dataframe
newdf = df4[1:]
newdf

   A  B  inserted_at_2  C   D  trunc_A  prod
1  2  5              2  5  10      NaN    10
2  3  6              3  6  18      NaN    18

In [143]:
 df4.sub(df4['A'],axis=0)
#axis = 0 means perform row after row (along row)
#axis = 1 mmeans perform along column (column after column)

     A    B  inserted_at_2    C     D  trunc_A  prod
0  0.0  3.0            0.0  0.0   3.0      0.0   3.0
1  0.0  3.0            0.0  3.0   8.0      NaN   8.0
2  0.0  3.0            0.0  3.0  15.0      NaN  15.0